#include <iostream>
#include <cmath>
using namespace std;
int main()
{
    int sum = 0, b = 0, n, i = 0, j = 0, i1 = 0, i2 = 1, max = 0, m = 0;
    cout << "n="; // кол-во чисел в последовательности
    cin >> n;
    while (j < n) // задаем последовательность до числа n
    {
        cout << "b="; // определенное число в последовательности
        cin >> b;
        j++;
        i = 0;
        i1 = 0;
        i2 = 1;

        while (i < b) //0 , 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584,4181,6765,10946,17711 числа Фибоначчи
        {
            i = i1 + i2; //  последнее число = сумме двух предыдущих(задаем подпоследовательность Фибоначчи)
            i1 = i2;
            i2 = i;
        }
         if (i == b) 
         {
            sum++;
         }
        else
            sum = 0;
        if (max < sum) // 1 1 2 3 5 (9) 1 1 2 3 5 8 13
            max = sum; //     5               7
                       // max=5 ; 5<7 ; max=7

    }
    cout << max << endl;
}

